<a href="https://colab.research.google.com/github/ashcrok/workshop/blob/master/Assignment%202.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Predict survival on the Titanic

## Variable Definition Key 

- survival Survival 0 = No, 1 = Yes 

- pclass Ticket class 1 = 1st, 2 = 2nd, 3 = 3rd 

- sex Sex 

- Age Age in years;  Age is fractional if less than 1

- sibsp # of siblings / spouses aboard the Titanic 

- parch # of parents / children aboard the Titanic 

- ticket Ticket number 

- fare Passenger fare 

- cabin Cabin number 

- embarked Port of Embarkation C = Cherbourg, Q = Queenstown, S = Southampton

In [0]:
import pandas as pd

In [0]:
df = pd.read_csv('https://raw.githubusercontent.com/ashcrok/workshop/master/data/titanic.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Things to keep in mind

- **Missing values** - The data might not be complete. Check for missing values and decide what to do with them: drop or fill them as you feel.

- **Select wanted columns** - Some features might not be so relevant. It's for you to decide!

- **Models can analyze only numeric data** - A learner can understand only numeric data. Because of that you will need to treat the fields not are not numeric by default and decide how do you want to treat them.

- **Classification** - Note that this is a binary classification problem: deciding if a passanger aboard the Titanic will survive or not. Use an existing implementation to train on your data. Split the data into Training and Testing data before doing so.